{
  "T-001": "Nov 14, 2025\r\nMeeting Nov 14, 2025 at 14:58 CST - Transcript\r\n00:00:00\r\n \r\nMario Maruthur: I know. I'm sorry, Miss Horn. I know you're mad at me. We We cured your cancer, though.\r\nChris Thompson: Hello.\r\nMario Maruthur: Uh, hey Chris, how are you?\r\nChris Thompson: Doing well. How are you?\r\nMario Maruthur: Good. Good.\r\nChris Thompson: Thanks for uh taking this time to to talk about this agreement and and then hopefully wrap this one up.\r\nMario Maruthur: Yeah. Yeah, of course. Um, so it sounds like you had some uh fruitful conversations with um with Andrew and I guess Amed\r\nChris Thompson: Right. Right. Right. And I mean the the the I think I said this in the email, but the the good big fact is that they're really not a competitor. They're really not, you know, a provider themselves. They're really more of like a management company, an MSO, a nonclinical entity that just provides this clinical support. And that that's that's a good fact and that it's not uh that's a kind of contractual joint venture factor that isn't present. The you know, the big bad fact is the economics that I've already pointed to is is it's really a split of collections.\r\n \r\n \r\n00:01:28\r\n \r\nChris Thompson: It's a split of the of the um revenue of of the of the program and I don't know that that's going to there's not much appetite to change that um from from but from skin skincures perspective. But now they did say a couple Yeah, they did have I mean there are some states that have stricter fee splitting prohibitions.\r\nMario Maruthur: Yeah, that's their that's their whole business model, I guess. So, Yeah.\r\nChris Thompson: Illinois, New York, just there's a couple other ones where they do a perfraction um payment. Um so they have done that but it sounds like they're resistance doing that out of the states where they really have to.\r\nMario Maruthur: So, they basically like tested the model different states and they've kind of figured out where they can get away with it, where they can't.\r\nChris Thompson: Right. Right. Right. And and ultimately I mean there there's a compelling argument that this is not a problematic contractual joint venture. There's a compelling argument that you know provided medical necessities established and the formalities are followed that this is a necessary and justified venture program.\r\n \r\n \r\n00:02:35\r\n \r\nMario Maruthur: So, I mean, what what I got from Andrew is basically that the DOJ and the OIG has has vetted this pretty aggressively and looked to see if there they'd run a foul and basically kind of gave up and\r\nAlvaro Gonzalez: That was pretty impressive.\r\nMario Maruthur: said, \"Okay, I guess it's fine.\r\nChris Thompson: Well, I I don't know that they've given up in the sense they're not going to keep on pressing. It sounds like this is an area that is vulnerable to audit. Um and part of it is just the nature of these are not services that the typical derm practice is going to be submitting. Now that that may be changing that may be more of a trend. Um these may become more typical but they still uh catch eyes. Um they still may invite scrutiny. the the fact that the DOJ has not succeeded in the handful of of previous uh cases does not mean they won't bring another one, but it does mean that you stand a good chance of succeeding, you know. So, so it's it's Right.\r\n \r\n \r\n00:03:39\r\n \r\nMario Maruthur: What what what's your take on on the on their like kind of size? I mean, it sounds like they're in around 500 DURM locations right now, which obviously I'm sure puts them on the radar for the of the government. Um,\r\nChris Thompson: Right. And I think that's why they've had these four or five different um audits or or actions that they've had to defend against because as they've expanded and I don't know at what point in the growth those were triggered whether there's more immediate feature. Yeah, I don't know about that. But um that that the size has invited scrutiny but so far the scrutiny has um you know it sounded to me and you know I couldn't get the specifics of this but it sounds like they are in some cases 100% successful in defending in some there may be some marginal um oh we need to change something and and it may be that they've incorporated those those points into their their current model but you know\r\nMario Maruthur: Yeah. So, do do you feel like in general I'm I'm within the bell curve, I guess, of you know, like I'm, you know, I'll be another practice is kind of joining their network or whatnot.\r\n \r\n \r\n00:04:50\r\n \r\nMario Maruthur: Um, I mean, I can't imagine because, you know, the the the scope of practice just in the Birmingham area alone, I mean, I think there's five or six practices now that are kind of part of their their network or whatnot. And um, so I mean, I I I feel like we're probably not an outlier from that perspective, I guess.\r\nChris Thompson: Yeah.\r\nMario Maruthur: So,\r\nChris Thompson: Yeah. Yeah. I think that's true. I think there's um you know, it's a bit of a roll of the dice as far as uh whether you'll get scrutiny, but I think the risk is relatively low. And I think if you do get that scrutiny, the risk is relatively low that there'll be disasters out.\r\nMario Maruthur: that we that we won't be able to defend against it successfully.\r\nChris Thompson: Yeah. Yeah. At least in large part. I mean, yeah. And it sounds like a lot of this boils down to medical necessity and establishing that and making sure that the right supervision is there. And a lot of stuff that is on the practices side and not strictly speaking um skin care side.\r\n \r\n \r\n00:05:46\r\n \r\nChris Thompson: So some of it is recordkeeping and um appropriate documentation and all that but um so yeah it's not that uh yeah they're their program is not a perfect shield to liability by any means but it has been tested somewhat already and so far has been largely unscathed. Um yeah, as this scales, is the DOJ going to get more aggressive about it or more uh compl not complacent, more accepting of the trend?\r\nMario Maruthur: Yeah.\r\nChris Thompson: I I don't know that answer. I don't know if the you know administration change changes the the approach or anything. Um so so all this to say there is I think there is a risk of inviting some sort of audit and if that audit comes there are some good facts some good defenses some good strategies we would have to defend against that. Um but I I'm not going to say there's no risk that there's a violation found. Um, I think that if the economics were different and it was a you're leasing the space, you're le or you're building out the space, you're leasing the equipment, you're leasing the text, on a non splitting profit standpoint, I think the risk is negligible, but as long as you have decent documentation, again, um, but it's not, um, I would not say it's high risk.\r\n \r\n \r\n00:07:23\r\n \r\nChris Thompson: Um, I think\r\nMario Maruthur: Yeah. Um and so you know from you know my perspective let's say that we did move forward with them. I mean, you know, obviously like the documentation needs or documentation needs to be good and you know, we, you know, um I talked to Andrew about, you know, being able to kind of work with him because he sounds like he's defended some of these in like UPIC audits and that kind of stuff. And um just kind of going over best practices and you I talked to the company. I'm sure they'll be fine with it. And Andrew said that he felt like they had good internal resources like with the company to make sure that we're, you know, documenting appropriately because obviously in their best interest to um for their, you know, kind of partner practices to um do well in any kind of audit.\r\nChris Thompson: Yeah. Yeah. I think that's that that's that's a good approach. I mean I I do think that and I actually asked Amed about this um you know recognizing that the documentation although it's to some degree as the physician the buck stops with you this is an area that you're venting into that they have the experience and and so what sort of expertise and resources are they able to provide and he said we have that covered.\r\n \r\n \r\n00:08:37\r\n \r\nChris Thompson: I mean, obviously he's gonna say that, but I think it's, you know, I I tend to believe that that they have this fairly well vetted. And so, um, yeah,\r\nMario Maruthur: Well, Matt, you know, I I asked, you know, kind of Andrew about that and Andrew, you know, and Andrew was pretty, I guess, positive or optimistic, I guess, just that their level of of, you know, kind of um consideration for for these things and that, you know, they've they've kind been through some of the medical and necessity audits and they've obviously had had some scrutiny from the OIG and DOJ. Um, and so far, you know, they've, you know, they've they've learned some lessons from it, it sounds like, and they're they're they're, you know, trying to to, you know, kind of be proactive about preventing, you know, but\r\nChris Thompson: Yeah. Yeah. Yeah. Yeah. And I mean, Andrew, I think he has a good sense of of this uh this program and how attacks might come and how defenses should be filtered against it. But um you know I I I am a fairly riskaverse person and so you know I'm I'm not going to sit here and say yeah you have nothing to worry about if you go forward and and I do\r\n \r\n \r\n00:09:58\r\n \r\nMario Maruthur: Yeah.\r\nChris Thompson: think if we do go forward we should put some strong recruit rec recruitment language in here some call back against that payment that we're making to them if we do get audited and then I mean but we'll have to think through what it means if if it's if it's due to your failure to document or something you know they're going to have a somewhat legitimate claim saying um this is this is you know on you but I I do think that if we're if they are providing the day-to-day management and they're providing a lot of the resources and practical knowhow some sort of clawback of that you know we road proposes a 50% management is probably appropriate. I don't know what you what you what you think about that, but Yep.\r\nMario Maruthur: Yeah. Yeah. Of course. I mean, if they're demanding the, you know, recruitment of for services that they they paid you, Medicare has paid us for, then, you know, I I think that's fair. I mean, as long as we've followed whatever best practices that they recommend, you know, because I don't have any ultimate control.\r\n \r\n \r\n00:11:03\r\n \r\nChris Thompson: So, that's something\r\nMario Maruthur: I mean, besides like making sure that we're documenting appropriately, which I think we need to definitely make sure that we we're doing. And that's, you know, before I get going, what I'm gonna tell them, I was like, you know, I want basically to make sure that we have, you know, a checklist of things that we need to follow and that we follow that for every note and um for every one of them, you know, basically, you know, figure out how to have some kind of like postnote audit to make sure that we're we're maintaining our compliance with a you know, kind of checklist and um doing all the things we're supposed to do because, you know, and and that's where, you know, I think Medicare is kind of tough with all list is just that they're obviously very\r\nChris Thompson: I'm sorry.\r\nMario Maruthur: ambiguous about any anything related to medical necessity. You know, they're just like, \"Well, make a make a good decision.\" And you're like, \"Okay, what does that mean?\" And they're like, \"Well, you don't know.\"\r\n \r\n \r\n00:11:51\r\n \r\nChris Thompson: Yeah. Yeah.\r\nMario Maruthur: So, yeah.\r\nChris Thompson: Consistent with the practices of the community and the standards of the of the profession and all this that they're not always uh not not always clear and sometimes a moving target. Um but yeah uh so I mean I think that's again I'm not saying do it. I'm not saying you probably you might like me to say hey don't do it this is this is this is hugely riskful risky and you know you have some um uh you know it'd be foolish to go yeah\r\nMario Maruthur: Well, I mean, you know, I hear what you're saying. You're basically saying that you see some some things about this that are problematic, but you know, like so far they've, you know, they've successfully defended against, you know, I I mean where I see that the problem with this\r\nChris Thompson: yeah and there's no per se violation which I could point to and say don't do this. It's illegal, you know. It's\r\nMario Maruthur: coming about is the is they're going to eventually attack it from a medical necessity side.\r\n \r\n \r\n00:12:51\r\n \r\nMario Maruthur: You know, Andrew said something that was interesting about this, which was, you know, per the NCCN guidelines, which are kind of the national comprehensive cancer network. Um, you know, patient choice is, you know, is is one of the is like in the algorithm. So, you basically, you know, you you give all all um, you know, kind of treatment options to the patient and then they get to pick pick out. And where Medicare historic, you historically has kind of went after some of this is that some providers they felt like didn't give the patient the option. They just said, \"Oh, well, you're treating it with we're going to treat this with radiation. That's all there is to it.\" and you know his you know Andrew you know kind of said said oh well you know as long as you know you pro you know you document things appropriately and you give patient all their all their treatment options then it ends up you know following the NCCN guidelines which has you know been a good defense against some of the medical necessity claims that the UPIC I thought that was interesting um I was a little surprised I mean I guess you know from a technical like cancer treatment guidelines it makes sense um but you know I guess they would need establish an LCD that you know basically says that that's not the case\r\n \r\n \r\n00:14:03\r\n \r\nChris Thompson: Yeah. Yeah. Yeah. I think that's that's right. And there's I mean this is an area that I think you should continue to monitor. We'll continue to monitor as the um as the practices get more established and\r\nMario Maruthur: I I I think they're going to clamp down on this one way or another. My my guess is what they're probably going to do eventually if you know this is probably what I would do if I was them is cut reimbursement for this set treating skin cancers in this setting with radiation because right now they're I think for all they're reimbursing relatively you know the same as if it was a radiation oncologist in you know a hospital setting or something like that. Now what the you know this is superficial radiation and what some of the you know like this company says is oh well if you go and get electron beam radiation which is a different type of radiation than this superficial radiation they're charging $30,000 instead of 10,000 or something like that. And you know the radiation oncologists are all saying well you know yeah that's true but you guys are like utilizing these codes like way more than we are now and we're radiation oncologists.\r\n \r\n \r\n00:15:08\r\n \r\nMario Maruthur: And I don't think they're wrong.\r\nChris Thompson: Yeah.\r\nMario Maruthur: I just think eventually they'll probably cut the reb Yes.\r\nChris Thompson: Yeah. I mean, I think you're you're right. And it sounds like I mean this this may change. This may not make sense in five years. But um one thing I do want to make clear though is you we're talking about medical necessity and you pick audits. this is one way that the government may come after you. But with the, you know, the contractual joint venture analysis and question that that's really under the AKS that that that's really more of a um a referral issue and that's you're not going to get a a UPIC audit necessarily because of a perceived AKS violation. Um you're going to get the OIG coming after you for some for the violation. So, and that's something they haven't seen. There may be no, you know, because of the fact that they're more of a management company and and they're not the ones um you know, they're not a competitor provider, they're maybe not on the the DOJ's high priority list as far as coming after something like this.\r\n \r\n \r\n00:16:15\r\n \r\nChris Thompson: But, you know, the fact that these upic audits have been successfully defended.\r\nMario Maruthur: Yeah. Hey. Um, hey, hold on one second.\r\nChris Thompson: Yeah.\r\nMario Maruthur: Somebody from Holland tonight. Oh, Zach's calling me.\r\nChris Thompson: Okay. Okay, go ahead.\r\nMario Maruthur: Uh, hey, Zach. What's going on? I'm good. I'm actually on a call with Chris Thompson right now. We're talking about Yeah. Okay. I I let me give you a call back in a minute. Okay. All right. Bye.\r\nChris Thompson: Yeah. Um, yeah. Yeah. So, so I just just wanted to you know that the fact that a successful strategy has been vetted defending one angle of attack from the government does not clo does not remove all the arrows from the government's quiver as far as what they might allege. But again, that that's you know what I've been looking at it as all along is is the you know what indishia of the contractual joint venture are present and what aren't.\r\n \r\n \r\n00:17:15\r\n \r\nChris Thompson: And it's just not a um\r\nMario Maruthur: So what what do you think that their likelihood? I mean like I mean I you know obviously you know like I don't want to do anything criminal. Um I mean it's really hard to gauge. I mean if I was like I guess the the first practice that is going to engage in this model with them. I my assumption here is you'd say sounds risky because they could definitely come back and say this is an AKS violation.\r\nChris Thompson: right, right, right. I mean, and although I mean the UPIC audits, I mean, as I understand it, the four or five cases they've had to defend were more along the lines of a of an audit situation than an AKS violation. But if the DOJ is looking at it from that angle, they're on the government's radar enough that you would think that if there is an AKS problem on its face that\r\nMario Maruthur: Yeah, it was a you know what, and I might be I might have missed this and Andrew said this was publicly available, but he said that the DOJ had like a three-year open investigation into this that basically just like petered out and, you know, nothing ever came of it.\r\n \r\n \r\n00:18:21\r\n \r\nMario Maruthur: And so I I don't, you know, I don't know enough about that.\r\nChris Thompson: Yeah. Yeah.\r\nMario Maruthur: And\r\nChris Thompson: And and that that you know it's hard to know what to infer from that because you know the prosecutors may change the administration may change the priorities may change or they may look into it and say there's nothing here no nothing to to continue going after and so they they back away. It's just it's good to know that there was not a negative, you know, consequence there, but the fact that it didn't go anywhere, I it's hard to put too much weight on it.\r\nMario Maruthur: Yeah, because it you see you feel like it could have just been politics that changed the Yeah.\r\nChris Thompson: Yeah. Could have been could have been the facts. It could have been the DOJ saying, \"Hey, I think there's something fishy here, but these aren't quite the right facts to address this issue the way we want to. We're going to wait for the next, you know, better fact situation to come this more egregious or something, you know, they're they're thinking about precedent as well.\" And\r\n \r\n \r\n00:19:21\r\n \r\nChris Thompson: so, I I don't know. I mean, that's Yeah.\r\nMario Maruthur: I mean, is there anything that So, I mean, obviously, it sounds like they don't want to change the their their fee splitting structure essentially. Um, and and that's the most problematic part. I mean, is there you know what what if I just tell them I listen you know let me split the cost of this installation with you or something which obviously cost me money but I mean would I be\r\nChris Thompson: Yeah. The the most problematic part is the fact that the practice is not really a financial risk. Yeah. Yeah.\r\nMario Maruthur: better off doing that? I mean, what's your I I can't imagine that they're going to turn down my offer to like help to to contribute to the buildout, you know, because, you know, I'm looking at it.\r\nChris Thompson: Yeah. Yeah. I I I think I think probably so. Yeah. I mean, I think if um Yeah. Yeah. I mean, I did.\r\nMario Maruthur: So, you know, I think the cost of the buildout is probably $40,000.\r\n \r\n \r\n00:20:13\r\n \r\nMario Maruthur: I mean, I don't know if I need to completely split that with them or what your thought would be, but I mean, would it be a reasonable strategy for me to, you know, kind of contribute to that to somewhat to say and then I mean, so what if I, you know, if I put in 10 10,000 towards or something like that?\r\nChris Thompson: Yeah. Yeah. I I I think I mean the the um the agreement references 25,000 for the room build out\r\nMario Maruthur: I mean, would you feel like that would decrease my exposure, I guess, from, you know, that because I mean, I I can't imagine that they're going to be like, \"No, you can't do basically the same agreement except, you know, you you you put some money towards this.\" Like,\r\nChris Thompson: Yeah. Yeah. I mean, I think it would. I mean, I think one starting point might be to figure out what that I mean, if you think it's 40,000 all in. Um, yeah.\r\nMario Maruthur: I I think it could be less than that.\r\n \r\n \r\n00:20:58\r\n \r\nMario Maruthur: I don't really I think that they they told me that initially, but I also think that it's in their since they were paying for it, it's in their interest to like inflate that somewhat, you know.\r\nChris Thompson: I mean, my thought is if you're going to do that, do it all and just because that that that makes it look less like a joint venture. I mean, it might help if I I can send you the um just for your kind of edification and the background, the the the um OIG's fraud alert on um contractual joint ventures.\r\nMario Maruthur: Sure.\r\nChris Thompson: So you know a little more about what I'm what I'm talking about as far as what I'm looking at. But but one of the things that I mean if you're sharing the cost then again that looks more like a joint venture. This is your buildup. It's your space. It's your providers. It's your billing tech though.\r\nMario Maruthur: So that they are they are paying for the cost of the employee and so the the radio what's that the tech.\r\n \r\n \r\n00:21:55\r\n \r\nChris Thompson: The tech the tech Yeah. Yeah. But but the the supervising providers are yours.\r\nMario Maruthur: Yeah.\r\nChris Thompson: Yeah. So, uh, does I don't think it moves the needle too much.\r\nMario Maruthur: So does it does the fact that they're paying the tech does that affect anything?\r\nChris Thompson: Um, I mean, again, if you are paying for it, the more the more it looks like your operation and you're you're taking it on as some sort of risk, um, you're expending capital, you're you're the more those factors are present, the better. But I don't think that them providing a tech is is a problem if they're providing supervising licensed professionals, you know, to to oversee the tech that that would be different.\r\nMario Maruthur: Yeah. Well, why don't why don't we present that as an option? I mean, I'll be honest. I'm I really don't want to spend 40k, but like, you know, I guess, you know, spend some percentage of that.\r\nChris Thompson: Yeah.\r\nMario Maruthur: I mean, you know, um and and you still feel like we we would get some some mileage out of that in terms of defense.\r\n \r\n \r\n00:22:49\r\n \r\nChris Thompson: Yeah. And what about we could just say instead of expressly saying we're going to share the cost, you can say, \"Hey, you're going to spend up to X for this buildout.\" And then they can Yeah. Yeah. I think so. Um Yeah.\r\nMario Maruthur: Well, why don't we why don't we present that to them because I mean at the end of the day I mean if it if it decreases my you know kind of liability and and it it you know because\r\nChris Thompson: Um yeah, right.\r\nMario Maruthur: well and I think too to some degree you know let's say that they did start bringing AKS you know claims against you know or cases against practices I mean and we're one of the ones that you know did this other you know had this other expense or whatever I mean they may be less likely to you know try to target\r\nChris Thompson: Right. I think that's right. And I mean also if you're not an outlier as far as utilization that that can be a good fact both from an audit perspective and and are Yeah.\r\n \r\n \r\n00:23:44\r\n \r\nMario Maruthur: Well, and it really comes down to at the end of the day like the I just want to make sure our checklist and the things that we're that we're we're following that I'm not like, you know, because we'll have people coming to us saying, \"Oh, I want this treat. I want that treated.\" You know, with radiation. I said, \"Well, here, you know, here are the guidelines from the, you know, from Medicare. You know, we can do that as long as you fall within the guidelines.\" And because you know one of the and I don't know if this fat this matters or not but they advertise on TV. So the company itself skincare and so you know they have a lot of people that are calling up saying hey you know we want to we want radiation we saw your commercial and I have patients that are asking me about this and so they're you know they're referring me patients more or less. Um, you know, I don't know. I mean, obviously this is part of their model and I'm sure their legal team has looked at this or what not, but like I I don't know.\r\n \r\n \r\n00:24:33\r\n \r\nChris Thompson: Yeah, that's not a that's not a factor that helps you for sure. Um, the fact that but but that that's not a directed marketing. That's not a direct like the fact that their marketing is successful and patients are going to them. There's not an affirmative decision by them to send you those patients. It's not ne it's not really a referral maybe analogous.\r\nMario Maruthur: Yeah, but my look, I mean, you know, as long as like I just want to have a good checklist to make sure that we're following guidelines and I'm not like I think that where people get in trouble with this kind of stuff is they start, you know, not following any kind of like algorithm or guidelines or anything for in terms of medical necessity and not even just like disregarding everything and not really you know thinking about\r\nChris Thompson: Yeah.\r\nMario Maruthur: whether what who you know even for you know I do mo surgery which is like a skin cancer surgery and so I have to decide you know we're do MO are we going to do a different procedure um and um you know I try to have some kind of like guideline that's you know that I follow with this um and um it's not perfect and I'm sure that somebody medic they could auto and say oh you're overutilizing blah blah blah but you know like I'm also not like do most for everything.\r\n \r\n \r\n00:25:51\r\n \r\nMario Maruthur: So, I mean, you know, there's no perfect like I don't know everything, you know, what they agree with this or that, but like, you know, I feel like as long as, you know, we have some reasonable algorithm where\r\nChris Thompson: Yeah, I mean sounds like you got the right approach, got the right processes.\r\nMario Maruthur: say, well, this is this is what we followed for our policy and, you know, we tra we tried to stick to it.\r\nChris Thompson: Right, right, right.\r\nMario Maruthur: I mean, like, they might not agree with us, but at least they're not going to say that we're like in flagrant violation or something.\r\nChris Thompson: Um, now I mentioned this in the email, but they had really pushed back against the idea of reducing the term from seven years to anything less than they say or he he says that it's because the valuation they\r\nMario Maruthur: I don't even understand what are they doing in a seven-year term and it's just so you can't like their\r\nChris Thompson: get from BMG, who's a good valuator, and I've used them a good bit, um, that their valuation assumes a seven-year term for the financial arrangement.\r\n \r\n \r\n00:26:48\r\n \r\nChris Thompson: I don't think that I think that's true, but I don't think that's material. I don't think that's for know for the um for like the 60% split or the range that they propose for the the the management fee.\r\nMario Maruthur: their valuation for their financing. You mean for interesting.\r\nChris Thompson: It's with it's within FMV range, which is good. That was one of the things that I asked them. Um but yeah, just because of the in capital that they have to get to make it to make it be commercially reasonable at fair market value.\r\nMario Maruthur: And so they're they're there's they're saying there's a correlation between the the fee splitting agreement and the the the length of the contract.\r\nChris Thompson: There's the assumption that it's going to last a certain amount of time. I think that that sevenyear length is arbitrary. That's just the number that they gave VMG saying, \"Hey, we this is\r\nMario Maruthur: I the only way that that practically affects me is is that the you know if I don't have enough volume then we you know they can terminate the agreement and which they would terminate the agreement if I didn't have any volume.\r\n \r\n \r\n00:27:47\r\n \r\nMario Maruthur: If I just stop referring patients to them they would just terminate the agreement I guess. Um, ultimately I mean like and you know Donnie told me that and I think you know whoever else like I don't know if if Stephen Scott told me that but um ultimately because you know they have a cost associated with having an attack there if you're not you know doing enough cases or whatever. Yeah. But other than that I mean they just don't want is that is that related to the non-compete as well or no?\r\nChris Thompson: Uh it it it may be related to the non-competes. Um not from\r\nMario Maruthur: Like if they leave there then could I just put our own I mean I'm not going to I'm not interested in it but like get our own you know radiation machine and hire our own tech and that's what a lot of derm practices do. They just have their own like tech and their own you know SRT machine.\r\nChris Thompson: You know what you could do depends on whether they accept our changes to the non-compete language that you you had a few that um yeah but also the language about the the you this does not apply to the\r\n \r\n \r\n00:28:41\r\n \r\nMario Maruthur: Well I mean I think the mile the 60 miles is too much. I mean\r\nChris Thompson: hold on the kind of the the the your own practice ice with your own um resources. Let's see, that's not how it was worded, but basically allowing, you know, if this terminates, your own private practice can can um can still do this activity without engaging a a vendor is basically how it reads. Um there uh it could it's probably uninforceable in Alabama.\r\nMario Maruthur: Yeah. I mean, and and and for them I mean, I would think that they that them prohibiting me from doing that could be problematic. Okay.\r\nChris Thompson: So So um pro it's not Yeah.\r\nMario Maruthur: It's it's a professional service at the end of the day and you can't you know even though yeah you can't because of medical necessity or medical availability and everything.\r\nChris Thompson: Yeah. So So yeah. So it's it's probably uninforceable which you know don't love agreeing with things.\r\nMario Maruthur: I I can't imagine that my next door neighbor I mean I guess that happens all the time.\r\n \r\n \r\n00:29:47\r\n \r\nMario Maruthur: be so funny. My next door neighbor is trying to sue me. That's funny.\r\nChris Thompson: Yeah. Yes. So this is one of the restrictions that you had in your the red line document that you sent over which I thought was a good one. You know I included it is this restriction does not apply to practices in-house radiation sorry in-house radiotherapy services and expires upon skincare breach the agreement that that kind of language that that you proposed which I thought that's good if we get them to agree to it that's good um there's other points like that that you know I incorporated the changes that you proposed in that in that document and added a few of my own um there's an open question as which ones they're going to push back on and which ones we can actually get. So\r\nMario Maruthur: at the end of the listen at the end of the day like I want to make sure that we're doing things the right right way and that if they suck that you know I mean I not stop referring patients to them and they'll leave.\r\n \r\n \r\n00:30:41\r\n \r\nMario Maruthur: Um I I don't really have a big interest in like you know we're opening our fifth location. We're probably going to end up with two more sometime during next year. So we end up with seven locations. I got a clinical trial division that we're trying to start. We're opening a pathology lab. You know, I'm not it's it's convenient for me for them to manage most of this. Like I'm not I want them I want it to work. I don't you know, um that being said, you know, I don't want to like enter into some agreement that's like, you know, I'm never going to be able to extricate myself from.\r\nChris Thompson: Yeah. Yeah. Yeah. And this is I mean as it's currently proposed by or by me I guess when I want to send over to you and this is based on some of the comments in your document that the low volume termination rights are mutual. that was something that was um you know proposed but but honestly it maybe we take that out I think that's almost unnecessary for us to ask if you don't refer yeah they're not going to you know keep\r\n \r\n \r\n00:31:29\r\n \r\nMario Maruthur: Yeah. I mean, yeah, let's just take it out because at the end of the day, like I think it's it's probably a D, you know, like it's that that'll work itself out. They're going to stay in there if there's low volume anyway.\r\nChris Thompson: this you have control over how long this agreement lasts really yeah yeah so I think we take that And I think I mean if it sounds like we could always see if it's a bluff, but it sounds like\r\nMario Maruthur: Yeah. Ultimately, if I just stop sending patients, then they'll I Yeah, I'll be honest.\r\nChris Thompson: the the sevenyear term is probably not negotiable. Um yeah, I don't know that it's worth it to Yeah.\r\nMario Maruthur: I like I actually remember Stephen um mentioned, you know, I just talked to him briefly in my in when I was in in his driveway and he actually mentioned about the seven-year term. So, for whatever reason, I think they really feel committed to that. And and I'm wondering if that has to do more with their business model and their finance the way they're financing their company or something.\r\n \r\n \r\n00:32:32\r\n \r\nMario Maruthur: And um because you know, obviously having like predictable revenue streams is it, you know, really affects the valuation of a of a given company. And um you know, I don't know how much financing they're taking out or whatever, but like if that having that as part of their contract is has allowed them to like get better financing because with they're they're having to finance these machines, you know, and they're they're like500,000 $600,000, I think.\r\nChris Thompson: Right.\r\nMario Maruthur: And so, you know, every time they put one in a practice, I assume that they're taking out a loan to do that. And in order to like get that loan, they may have to say, \"Oh, we have a seven-year commitment for this practice.\"\r\nChris Thompson: Right. Right. And that's honestly one of the other potential sticking points where we we took out that they had a security interest in your receivables in their I agree.\r\nMario Maruthur: Yeah, I'm not I'm not good with that. Yeah, they can have a scary interest in the receivables from this particular thing, but like Yeah.\r\n \r\n \r\n00:33:23\r\n \r\nChris Thompson: Yeah, I agree that that's problematic and I took it out. I think it should be taking out, but based on how their economics work, how their financing works, that might be pretty material for them. I I don't know. It's not We didn't get down down to those details.\r\nMario Maruthur: You know, but like I what what wouldn't I mean so like I guess they're worried about me getting paid and then not paying them. But like how would that it because the only way that would that would they would need to go after other receivables is if I didn't get reimbured for the what they for for these for these specific like radiation claims. So like if I'm not getting paid reimbured for their radiation claims like I they're not going to get paid anyway. So I don't I guess I'm a little confused about this whole thing because\r\nChris Thompson: Yeah, it is really just it's a protection against them against you not paying them based the percentage based the fee. But, you know, in light in light of what he said that that the equipment is expensive.\r\n \r\n \r\n00:34:22\r\n \r\nChris Thompson: If if they put this equipment there and you stop paying, the only recourse is to sue. But I think we tell them, hey, that that is their only recourse. If if you breach if you breach Yeah.\r\nMario Maruthur: Well, they can they can sue me. I mean, but you know Yeah. I just don't know in what scenario they would want they would need to have a lean on my on my like non-radiation claims like in what in what scenario because it didn't make any sense if if I get\r\nChris Thompson: Uh, I don't know. I guess it's Yeah.\r\nMario Maruthur: paid $100 they want their 50 bucks and I'll pay them their 50 bucks and they have a claim on that 50 bucks and if they if I don't they don't if I don't pay them it then they can\r\nChris Thompson: Yeah.\r\nMario Maruthur: sue me and then they can say well he owes 50 bucks like I don't understand exactly Why they would ever Yeah.\r\nChris Thompson: Yeah. I I I agree that that's kind of why I would have taken that out even if it had been Um, so it may be just for some financing reason that they they care about that.\r\n \r\n \r\n00:35:11\r\n \r\nMario Maruthur: You ask about it be like in what scenario or would you need to like\r\nChris Thompson: Um, I I do think we put some language about recruitment and if they say no, you know, we're not going to pay you back any of this management fee, then we I think we may have to doubt their confidence in the model a little bit. If they're not willing to back up that confidence with, yeah, if if an audit happens and we you have to pay it back, you we have to pay you back, too. So, uh, Yep.\r\nMario Maruthur: Yeah, I mean we're we're I mean it's really we should we should both have skin in that game except otherwise I'm basically on the hook for like twice what I'm actually like earning.\r\nChris Thompson: Yep. Yep. Yep. So, you have Yeah. So, um, so that that that's another one that I think we propose. Right. Right.\r\nMario Maruthur: So I mean because Yeah.\r\nChris Thompson: Yeah. Um, so I I the way way we've been discussing it sounds like and and and I'm not making the decision decision for you, but it sounds like with these changes in the agreement, we're we're okay to propose agreement back to skincare.\r\n \r\n \r\n00:36:23\r\n \r\nMario Maruthur: Yeah. Yeah. Yeah. I'm I'm I'm good with that. I mean, you know, at the end of the day, I mean, like, there's unpredictability in this, but there's unpredictability in the world. I don't know. Maybe we'll be we'll have AI overlords in three years, so it won't matter.\r\nChris Thompson: Yeah, that's right.\r\nMario Maruthur: I don't know.\r\nChris Thompson: Would not be surprised. Maybe maybe we already do. You know, we shall know.\r\nMario Maruthur: We might already, you know, I might actually just be a virtual client, you know?\r\nChris Thompson: Yeah. Yeah. Yeah. So, it sounds good. I'll I'll try to get this out. Uh I don't know if you've had a chance to go through the document to see my proposed changes yet.\r\nMario Maruthur: No, I mean Okay.\r\nChris Thompson: How about don't do that now. I'll send you a updated one Monday and then I could go ahead and then send it to skincare and say subject to my client's comments who still Yeah.\r\n \r\n \r\n00:37:10\r\n \r\nMario Maruthur: Yeah, that's fine. You go and send it to them, you know, like as long as you told me the salient points at that.\r\nChris Thompson: Yeah. Yeah. I would like to send it to you at least let you have a chance to eyeball it before just to see if anything pops.\r\nMario Maruthur: Okay. Yeah, I'll try to I'll try to scan through it. I mean, you'll you'll have your your comments in highlighted or in red or whatever.\r\nChris Thompson: Yeah, they'll be tracked. Y\r\nMario Maruthur: Okay. Yeah. Um yeah, that's fine. I mean, I can't imagine. I mean, at the end of the day, yeah, I mean, I I do think that that recruitment might be a sticking point because I mean, just I would hate to be on the hook for 100% when I'm only getting paid 50%. You know, and I I can't imagine I mean, you know, they can put some language in there as long as this, you know, we've documented per their guidelines or whatever it is or, you know, Yeah.\r\n \r\n \r\n00:37:54\r\n \r\nMario Maruthur: I mean, I understand why they wouldn't want the liability. It's the same reason I don't want the liability, you know.\r\nChris Thompson: Uh oh, and just a reminder that with with with when when these conversations are recorded, there may not be attorney client confidentiality sometimes. So just you know I don't know if you typically record the Google meet conversations or not but there there may be some risk to maintaining a record uh that on that external platform but yeah yeah yeah I mean\r\nMario Maruthur: Yeah, because I guess it hasn't been tested.\r\nChris Thompson: it's I don't know what sort of security agreements that they that they have to maintain but um yeah so something to be aware Okay.\r\nMario Maruthur: Yeah, I don't know. I mean, we we have a BAA with Google, so I don't know if because So, you know, with with the BAA that it changes their like data retention policy.\r\nChris Thompson: Yeah. Yeah. Yeah.\r\nMario Maruthur: Um, so theoretically, you know, it should be within just within our own like workspace, I guess.\r\nChris Thompson: That's good.\r\n \r\n \r\n00:38:53\r\n \r\nChris Thompson: Okay. Okay.\r\nMario Maruthur: Um, but yeah. So, you're saying that like any any recorded transcript of of a meeting regardless whether it's like AI's involved or not or not?\r\nChris Thompson: I It depends on where it's stored. So, if it is only short in your space, that probably is a little bit better than than otherwise. So, I'm not saying any I'm saying there there's some murkiness around the edges of of when you're recording um a conversation. I mean, absent the recording, anything we say is attorney client privilege and that's good.\r\nMario Maruthur: Yeah. Well, we I'd like to maintain attorney. Yeah. So, you're basically saying we probably we're probably better off just not recording meetings.\r\nChris Thompson: Yeah, I I think so. I mean, you know, just Yeah.\r\nMario Maruthur: Yeah, I I actually had a conversation with Zach about it. We have Yeah, I need to remember that because our our our Google Meets are set to automatically record and transcribe. like we don't we aren't we don't manually do it.\r\n \r\n \r\n00:39:40\r\n \r\nMario Maruthur: We just have them like automatically.\r\nChris Thompson: Yeah.\r\nMario Maruthur: We actually have all our stuff um in transcripts and then you know we feed it to AI and it pulls out action items automatically.\r\nChris Thompson: What what AI uh platform do you use?\r\nMario Maruthur: Jim Jim and I Yes.\r\nChris Thompson: Okay.\r\nMario Maruthur: So we we have you know we use Google like Google Workspace and so we have our we have like the enterprise plan with them and no no it's not cheap or anything like that but um yeah we have\r\nChris Thompson: Okay. Okay. that that that's going to not not chat GPT because that would be you know more problematic. So okay. Yeah.\r\nMario Maruthur: BAA but you're right yeah I mean like I you know it it sounds like there's probably untested law whether or not if you have an AI noteaker if it it punctures\r\nChris Thompson: Yeah. Yeah. it would alert stored and the agreements with the platform and the BAA is good to have for the PHI purposes but for turn of client privilege it might not be it might be a square pay round hole situation where it's not really addressing the same issue so I'm not saying it's a problem I'm saying something to be aware of though I'm sure\r\n \r\n \r\n00:40:40\r\n \r\nMario Maruthur: Yeah, no one knows if it's a problem yet. Yeah. Yeah, that'll be interesting. Yeah, I'm sure that that'll be tested at some point soon. Modern problems. Okay. Yeah, we'll just um that sounds good. Yeah, I'll I'll email um So, can you forward me? I don't know if I have Matt's email, actually. Matt Cox and um that's fine.\r\nChris Thompson: Okay, I will do so. And we was supposed to have the the additional letter for you today. I'll check with my assistant before she goes to see if it's Sure.\r\nMario Maruth\n\n[... Truncated for testing ...]",
  "T-002": "tnv-ehig-yge (2025-11-14 13:31 GMT-6) - Transcript\r\nAttendees\r\nAlvaro Gonzalez, Mario Maruthur\r\nTranscript\r\nAlvaro Gonzalez: Hey.\r\nMario Maruthur: Hey everyone.\r\nAlvaro Gonzalez: I sent you a message there because that's what Li Luigi said or sorry Joshy said that I found a problem that there were things deleted and it sent something to confirm that with the Luigi. So if you can check for an update\r\nMario Maruthur: Yeah. Let me s*. Yoshi sent back the following message and said he found a critical issue.\r\nAlvaro Gonzalez: Mhm.\r\nMario Maruthur: 700,000 deletions. That's a problem. We ask it how we can prevent this from happening again. Interference Do you know for these secrets here do I copied the entire thing including the apostrophes here.\r\nAlvaro Gonzalez: Mhm. Yeah.\r\nMario Maruthur: Is that right?\r\nAlvaro Gonzalez: As far as I know. Yeah. Yeah.\r\nMario Maruthur: I added those three secrets. that being said, I want to make sure that I added the correct JSON value from the code block. what I like for the GCP service account this is what I added as the value but I wanted to make sure that I needed to add all these apostrophes and everything too.\r\nMario Maruthur: So, it sounds like it'll take a few days from Twilio What did you tell them was our project?\r\nAlvaro Gonzalez: Yeah. Yeah.\r\nMario Maruthur: Because we're using it for basically internal communications for our team.\r\nAlvaro Gonzalez: Exactly. Yeah. That's how I describe it that it's an internal system for notifications from a system that we're using and it should not communicate with just probably a few users and also I described that we might get because I guess that at some point we might set it up to receive codes or authentication codes and stuff like that.\r\nAlvaro Gonzalez: Erh but yeah I was explicit that it was internal it's not and yeah I followed the recommendation that Claude said about selecting the volume that we will have that it's low basically\r\nMario Maruthur: Come on J.\r\n00:05:00\r\nMario Maruthur: Albert, did you get disconnected?\r\nAlvaro Gonzalez: No, no,…\r\nAlvaro Gonzalez: I'm here.\r\nMario Maruthur: …\r\nMario Maruthur: so I have a few questions related to this. one, obviously I would like to prevent this from happening again. should I think one of the things my goal is to create a series of checklists for certain activities or events that we do repeatedly. one, should we create a checklist to prevent this from happening again? Two, what should the checklist be called? And three, where should it live? we have a checklist manager MCP server, I believe. I want to make sure that that is working.\r\nMario Maruthur: And then we should create a checklist for I guess this would be related to a GitHub commit to prevent this from happening again. But you tell me your thoughts on So this is where we need to start building systems. Alvo we need to have a mutable checklist for or…\r\nAlvaro Gonzalez: Yeah. Yeah.\r\nMario Maruthur: \r\nMario Maruthur: set of checklists for everything. Let's see what they come back and say. I mean, it's good that we caught it and we were able to reverse it. So, useful.\r\nAlvaro Gonzalez: Yeah. Yeah. that at least proves that the communication between systems is something good.\r\nMario Maruthur: One thing we can do is have a scheduled check-in, using our bot automation system.\r\nAlvaro Gonzalez: Mhm.\r\nAlvaro Gonzalez: Yeah. Mhm.\r\nMario Maruthur: where they check in maybe once an hour and…\r\nMario Maruthur: make sure that both are in sync and everything's working properly. all right, Mr.  Whitaker is clear. All right.\r\nMario Maruthur: So, I need to get this checklist manager working. And so, we need a plan for it. And then we'll create it using multiple agents. We see what they say here. Let's see. Let me see.\r\nMario Maruthur: This is it.  We got CS service account key. Let's see.\r\n00:10:00\r\nMario Maruthur: Oops.\r\nAlvaro Gonzalez: According to Yoshi, the Luigi restore everything properly. Yeah, actually that's why on my side there were just a few holders on my side.\r\nMario Maruthur: All right.\r\nAlvaro Gonzalez: So now everything is back again.\r\nAlvaro Gonzalez: yeah.\r\nMario Maruthur: I just updated the secret for the service account key and the GCCP service account. see if you can confirm that everything is working correctly now.\r\nMario Maruthur: let's follow your recommendations and deploy to all workspaces and then push the checklist to GitHub so Yoshi and Alvo can  use it and then install the pre-commit hook in the MCP infrastructure.\r\nMario Maruthur: You can update the workspace guide and then when you're done all that, we'll investigate the checklist manager MCP server and discuss that. Are you…\r\nMario Maruthur: which workspace Are you using the medical patient data? Are you using the operations or what are you using?\r\nAlvaro Gonzalez: the operations…\r\nAlvaro Gonzalez: but I have the medical patient data loaded as well.\r\nAlvaro Gonzalez: Yeah. Yes.\r\nMario Maruthur: Okay, I've been trying to sync across all the workspaces today,…\r\nMario Maruthur: but I wasn't before. So, I got that call in 15 minutes.  Backup failed again.\r\n00:15:00\r\nMario Maruthur: I assume the Twilio thing is not there yet.\r\nAlvaro Gonzalez: let me check.  No, not yet.\r\nMario Maruthur: Please review the six layer backup  Let me know when you're ready to discuss one of the components that just failed.\r\nMario Maruthur: What's the doc sync? I mean, I think we should have it syncing documentation to Google Drive.  So, I'd rather fix the duck sig.\r\nMario Maruthur: I didn't hear anything.  I don't know.\r\n00:20:00\r\nMario Maruthur: It's clear. All right, Jeremy, let we let them know that the arm in four is clear.  Raven can finish closing that\r\nMario Maruthur: Make sure the right person.\r\nMario Maruthur: You definitely did not talk.  I\r\nMario Maruthur: think the checklist manager is going to be an essential component of our system. I don't want to overengineer it. So please review the different tools included in it and make sure that it is not overengineered and it'll be maintainable and scalable and transferable.  My goal is really to use the checklist manager to make sure that in all key repeatable tasks we have a definfined checklist that is always followed that there's not redundant checklists and that the checklist that we're managing apply we have checklist for both our workspaces for GitHub and probably more importantly for our Google workspace where we\r\nMario Maruthur: have a very complex practice management system that we need to be using checklist for our operations. your thoughts on this  What are the specific instructions for setting up the branch protection?\r\n00:25:00\r\nMario Maruthur: weird. Yeah.  Where'd he go? He's got to clear the forehead.\r\nMario Maruthur: Yes, I put there's no sharks.\r\nMario Maruthur: I was like, \" my gosh.\" of course, you can't\r\nMario Maruthur: Don't ask me that. It didn't want to freeze. The forehead has all those oily glands. Yeah, I think it's Look at You cleared all the pneumonia. I have pneumonia anymore.  All right. Face it. And seven's clear. Seven. Two's clear.\r\nMario Maruthur: Thank  There we go.\r\n00:30:00\r\nAlvaro Gonzalez: I think that the call is at 300 p.m.\r\nMario Maruthur: Not two.\r\nAlvaro Gonzalez: No. you said you're sure. Let's plan on going to call out tomorrow at 3 p.m.\r\nMario Maruthur: Okay.\r\nAlvaro Gonzalez: And how they say it? agreed. you'll get on meet or…\r\nMario Maruthur: I don't know name.\r\nAlvaro Gonzalez: we'll wait for them.\r\nAlvaro Gonzalez: So I went over the file management files and marked the ones that were missing as PHI and…\r\nAlvaro Gonzalez: but also we have a bunch that we don't have any data on some dashboards. Okay.\r\nMario Maruthur: I'm sorry.\r\nMario Maruthur: Give me one second. Recourse.\r\nMario Maruthur: I'm not sure what I'm supposed to do here.\r\nMario Maruthur: Look for and check these status checks if they appear. Do I put that somewhere? I like paste these right here. I don't.\r\nAlvaro Gonzalez: Okay. Mhm.\r\nMario Maruthur: So it says require branches to be up to date before merging. So I click that.\r\nAlvaro Gonzalez: and check this status check if they try\r\nMario Maruthur: require status checks to pass before meeting here.\r\nAlvaro Gonzalez: or try to type the first one on that other box. I can back up to Jesus. Yes.\r\nMario Maruthur: Oops. Number\r\nAlvaro Gonzalez: Excellent.\r\n00:35:00\r\nMario Maruthur: Yeah, I don't think it allows.\r\nMario Maruthur: I don't know. Maybe I should leave this alone. I really don't know. I guess you can look this up later, Robert, and see if there's something we should do.\r\nAlvaro Gonzalez: Yeah, for sure.\r\nAlvaro Gonzalez: Hey, I'm creating amazing Okay. Yeah.\r\nMario Maruthur: Yeah, it's this B branch protection one.  You can just figure that later on. I don't know. I'm not going to mess with it. Everything else is working. I guess I'm going to defer the branch protection for now. mostly because I don't understand how to set it up and what everything means. But Alvo is going to work on it later.\r\nMario Maruthur: Got it in a box.  Can you send a Google Meet?\r\nAlvaro Gonzalez: Yeah. and…\r\nAlvaro Gonzalez: Chris replied that asking to send a me so we can join and that it's just you to have it handy and…\r\nMario Maruthur: Is it 2 o'clock or…\r\nMario Maruthur: 3 o'clock? Okay. …\r\nAlvaro Gonzalez: I send it to him so he can join\r\nMario Maruthur: Let me see what this does here.\r\nAlvaro Gonzalez: Give me Okay.\r\nMario Maruthur: Yeah.\r\n00:40:00\r\nMario Maruthur: Is that two  Ready?\r\nMario Maruthur: that is two ready?  Okay. Not that it's super relevant, but I don't think that we're going to be using our workspace, including the checklist manager for anything PHI or clinical related for right now.\r\nMario Maruthur: it's mostly going to be for business management and our kind of workspace and Google Drive operations.  Please create a plan for the checklist manager server and you can create it in the implementation project projects folder. This will be an implementation project.\r\nMario Maruthur: All right, Jeremy, you have a\r\nMario Maruthur: Where we can put all these future?\r\nMario Maruthur: I didn't\r\n00:45:00\r\nMario Maruthur: Hello.  Where'd you go?\r\n00:50:00\r\nMario Maruthur: My money works sale.\r\nMario Maruthur: Okay.\r\nMeeting ended after 00:51:44 👋\r\nThis editable transcript was computer generated and might contain errors. People can also change the text after it was created."
}